[
    {
      "ID": 438887,
      "DurationInSeconds": 7678,
      "Title": "AngularJS: Adding Registration to Your Application",
      "ShortDescription": "Create a simple registration system that allows users to log in and out of your applications, with AngularJS and Firebase.",
        "Thumbnails": [
          { "FullURL": "https://cdn.lynda.com/courses/438887-635827438390248957_88x158_thumb.jpg"},
          {"FullURL": "https://cdn.lynda.com/courses/438887-635824152732403282_338x600_thumb.jpg"}
        ],
      "URLs": {
        "www.lynda.com": "/AngularJS-tutorials/AngularJS-Adding-Registration-Your-Application/438887-2.html"
      },
      "WelcomeVideoId": 445604
    },
    {
      "ID": 438886,
      "DurationInSeconds": 2512,
      "Title": "AngularJS: Form Validation",
      "ShortDescription": "Learn how to implement dynamic form validation on any HTML form using the built-in validation properties and methods in AngularJS.",
        "Thumbnails": [
          {
            "FullURL": "https://cdn.lynda.com/courses/438886-635827439080742024_88x158_thumb.jpg"
          },
          {
            "FullURL": "https://cdn.lynda.com/courses/438886-635814741830888421_338x600_thumb.jpg"
          }
        ],
      "URLs": {
        "www.lynda.com": "/AngularJS-tutorials/AngularJS-Form-Validation/438886-2.html"
      },
      "WelcomeVideoId": 445587
    },
    {
    "ID": 417641,
    "DurationInSeconds": 17711,
    "Title": "Bootstrap 3 Essential Training",
    "Description": "<p>Bootstrap is a popular framework designed for building responsive, accessible, and mobile-ready websites. An open-source platform using HTML5, CSS3, and jQuery, it features a 12-column grid, icons you can incorporate into your designs, and fully functional JavaScript components that are ready to use.</p><p>This course provides everything you need to know to get started building websites with Bootstrap, and is built with our new practice environments in mind, which let you develop your code along with author Ray Villalobos. Ray will review Bootstrap's grid, CSS classes, and JavaScript components (dropdowns, modals, carousels, and more), and help you integrate them into your own sophisticated websites.",
    "ShortDescription": "Everything you need to know to get started building responsive, accessible, mobile-first websites with Bootstrap 3.</p>",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/417641-635760301871294629_125x224_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/417641-635762922777948496_1380x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Bootstrap-tutorials/Bootstrap-3-Essential-Training/417641-2.html"
    },
    "WelcomeVideoId": 429420
  },  {
      "ID": 375925,
      "DurationInSeconds": 7492,
      "Title": "Sass Essential Training",
      "Description": "<p>Learn the fundamentals of Syntactically Awesome Stylesheets (Sass), a modern web development language that helps you write CSS better, faster, and with more advanced features. Ray Villalobos shows you the best way to install Sass and work with its main features: variables, nesting, partials, and mixins. Plus, learn how to use SassScript to create complex functions from Sass lists and control statements.</p><p>Topics include:</p><ul><li>Working with variables</li><li>Nesting styles</li><li>Creating mixins</li><li>Conditional statements and loops in SassScript</li><li>Extending your mixins</li><li>Working with lists and maps</li></ul>",
      "ShortDescription": "Learn the fundamentals of Syntactically Awesome Stylesheets (Sass), a modern web development language that helps you write CSS better, faster, and with more advanced features.",
      "Thumbnails": [
        {
          "FullURL": "https://cdn.lynda.com/courses/375925-635797211412111970_88x158_thumb.jpg"
        },
        {
          "FullURL": "https://cdn.lynda.com/courses/375925-635791240452214933_338x600_thumb.jpg"
        }
      ],
      "URLs": {
        "www.lynda.com": "/Sass-tutorials/Sass-Essential-Training/375925-2.html"
      },
      "WelcomeVideoId": 435554
    },
  {
    "ID": 124079,
    "DurationInSeconds": 12528,
    "Title": "Bootstrap 3: Advanced Web Development",
    "Description": "Generate your own interactive website from scratch with Bootstrap, the mobile-friendly framework from Twitter, in this start-to-finish course with developer and author Ray Villalobos. First, you'll plan and prototype the interface with MindMaps and Balsamiq Mockups. Next, download Bootstrap and dive into organizing your site structure with its scaffolding feature—adding PHP includes to break your code into reusable modules and building in the core navigation. Ray then shows you how to build interactive carousels, modal features, and forms, and control these features with JavaScript. Finally, learn to style it all with LESS and prepare to publish the results online.",
    "ShortDescription": "Generate an interactive website from scratch with Bootstrap.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/124079-635383264168096755_138x244_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/124079-635466752190145759_1440x2560_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Bootstrap-tutorials/Bootstrap-3-Advanced-Web-Development/124079-2.html"
    },
    "WelcomeVideoId": 145007
  },
  {
    "ID": 138156,
    "DurationInSeconds": 2817,
    "Title": "Bootstrap 3: New Features and Migration",
    "Description": "Bootstrap 3 is here, and it supports mobile design and responsive CSS better than ever. Join author Ray Villalobos for an overview of the new classes, mobile-first approach, and other enhancements in Bootstrap 3, and learn how to migrate your sites and files to the new framework. Find out about the new installation options, updates to grids and scaffolding, and changes to the handling of type, images, and JavaScript. Then learn to integrate the new list group and panel components into your workflow. The course closes with a look at migrating a sample site from Bootstrap 2.3 to 3.0, from replacing template files to tweaking your grid, navigation, and images.",
    "ShortDescription": "Learn about the new CSS classes, mobile-first approach, and other enhancements in Bootstrap 3.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/138156-635383799816665334_128x227_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/138156-635400835638025199_1046x1858_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Bootstrap-tutorials/Bootstrap-3-New-Features-Migration/138156-2.html"
    },
    "WelcomeVideoId": 144516
  },
  {
    "ID": 186538,
    "DurationInSeconds": 11940,
    "Title": "Bootstrap Layouts: Responsive Single-Page Design",
    "Description": "Find out how Bootstrap can transform your standard HTML websites into inspired single-page designs. This course is a project-based approach to learning how to manipulate website layouts with the Bootstrap framework. Staff author Ray Villalobos tackles Bootstrap's layout classes, like containers, rows, and columns, and shows what it takes to customize Bootstrap's CSS and address layout challenges like multiple grids and columns. Plus, learn how to track navigation as users scroll, with the ScrollSpy plugin, and create a full-screen, responsive image carousel.",
    "ShortDescription": "Find out how Bootstrap can transform your standard HTML websites into inspired single-page designs.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/186538-635721225380088463_129x228_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/186538-635603121825190026_1470x2352_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Bootstrap-tutorials/Bootstrap-Layouts-Responsive-Single-Page-Design/186538-2.html"
    },
    "WelcomeVideoId": 371573
  },
  {
    "ID": 368920,
    "DurationInSeconds": 12679,
    "Title": "Building a Mobile App with AngularJS and Ionic",
    "Description": "Creating hybrid mobile applications is a great way to leverage your knowledge of web languages like HTML5, CSS, and JavaScript. Modern frameworks such as AngularJS and Ionic make it easier with pre-built templates and components. In this course, staff author Ray Villalobos shows how to install the Ionic framework and set up a development environment suitable for building web-based apps. He reviews the core Ionic components: prebuilt, easy-to-use features such as buttons, lists, tabs, and forms. Then Ray shows how to combine these components with Angular.js models, views, and controllers to build a single page app with sliders, pull-to-refresh functionality, and search. The training culminates in building a multi-page app, which you'll learn how to customize with CSS.",
    "ShortDescription": "Learn to build native-style applications that leverage your existing knowledge of HTML5, JavaScript, and CSS by using AngularJS and the Ionic framework.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/368920-635664455141474470_139x247_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/368920-635711120105758473_1440x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/AngularJS-tutorials/Building-Mobile-App-AngularJS-Ionic/368920-2.html"
    },
    "WelcomeVideoId": 386098
  },
  {
    "ID": 182174,
    "DurationInSeconds": 17736,
    "Title": "Building a Responsive Single-Page Design",
    "Description": "<p>Learn how to build dynamic, responsive single-page designs with HTML, JavaScript, and CSS. The website featured in this course combines docking navigation, columns that adjust without cluttering your site layout or HTML markup, and animated scrolling effects that respond to user direction. Author Ray Villalobos shows you how to build it. He starts with a lean, easy-to-read template, and then explains how to add the features that make single-page designs so great, with these frameworks: Compass, whose Sass mixins help you leverage CSS3 features like Flexbox; Susy 2, the framework that \"subtracts\" the math from responsive grid design; ScrollMagic, for adding \"magical\" scroll effects; Breakpoint, which makes writing media queries in Sass a snap; But this course isn't just about the tools. It's a realistic project that epitomizes many of the design challenges website developers face in the real world. Start watching now and learn how to use HTML, jQuery, and CSS to build your own dynamic, deeply responsive designs.",
    "ShortDescription": "Learn how to build responsive single-page websites (with animation and scrolling effects) using frameworks like Compass, Susy, and Breakpoint.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/182174-635771061565171730_130x230_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/182174-635621719148154009_1200x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/CSS-tutorials/Building-Responsive-Single-Page-Design/182174-2.html"
    },
    "WelcomeVideoId": 193650
  },
  {
    "ID": 163094,
    "DurationInSeconds": 10010,
    "Title": "Building a Website with Node.js and Express.js",
    "Description": "<p>JavaScript is the language for adding interactivity to a website, but there's so much more it can do. Enter Node.js and Express.js, two technologies that extend the capabilities of JavaScript. The Node platform allows you to develop server-side applications with JavaScript that you can then easily publish as websites with the Express framework. In this course, Ray Villalobos walks through the entire process of creating a website on a server with Node.js and Express.js. After going over the installation process, Ray shows how to build a basic application, control the state of an application with routing, and use templates and partials. Then he demonstrates how to quickly structure a site with Express Generator, work with models and views, and publish the final website using Heroku.</p><p>Note: This course is intended for intermediate front-end web developers who are familiar with creating web projects and understand JavaScript basics.",
    "ShortDescription": "Find out how to develop server-side JavaScript applications with the Node platform that you can then easily publish as websites with the Express framework.</p>",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/163094-635388588783769151_131x232_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/163094-635621317414729372_1800x3200_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Expressjs-tutorials/Building-Website-Nodejs-Expressjs/163094-2.html"
    },
    "WelcomeVideoId": 179059
  },
  {
    "ID": 369707,
    "DurationInSeconds": 13123,
    "Title": "Code Clinic: JavaScript",
    "Description": "<p>Successful programmers know more than a computer language. They also know how to think about solving problems. They use \"computational thinking\": breaking a problem down into segments that lend themselves to technical solutions. Code Clinic is a series of ten courses where lynda.com authors solve the same problems using different programming languages. Here, Ray Villalobos works with JavaScript.</p><p>Ray introduces challenges and then provides an overview of his solutions in JavaScript. Challenges include topics such as statistical analysis, searching directories for images, and accessing peripheral devices.</p>",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/369707-635708746319705336_137x242_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/369707-635711716696716488_1440x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/JavaScript-tutorials/Code-Clinic-JavaScript/369707-2.html"
    },
    "WelcomeVideoId": 414856
  },
  {
    "ID": 133353,
    "DurationInSeconds": 3192,
    "Title": "Coding Faster with Emmet",
    "Description": "Looking for a tool to make you a faster and more efficient programmer? Emmet provides a shortcut language for writing HTML, XML, and CSS, based on an abbreviation structure most developers already use that expands into full-fledged HTML markup and CSS rules. Let Ray Villalobos show you how to install the Emmet plugin for your favorite text editor and start using its handy shortcuts for making copies of elements; climbing, grouping, and numbering; matching tags; and even complex CSS3 features like gradients.",
    "ShortDescription": "Learn to use Emmet's abbreviated shortcuts to write full-fledged HTML, XML, CSS, and code faster and more efficiently.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/133353-635117586295533184_134x240_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/133353-635742364939773831_1332x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Emmet-tutorials/Coding-Faster-Emmet/133353-2.html"
    },
    "WelcomeVideoId": 143856
  },
  {
    "ID": 85083,
    "DurationInSeconds": 11370,
    "Title": "Creating an Adaptive Web Site for Multiple Screens",
    "Description": "This course demonstrates how to build a web site that automatically adapts its layout to various screen sizes, orientations, and resolutions. Ray Villalobos shows how designers and developers can create a single HTML document and customize its display for desktop browsers and mobile devices such as the iPhone, Android phones, and tablets. The course covers creating a basic HTML5 structure and using reset templates, and styling the site with CSS. ",
    "ShortDescription": "How to build a web site that automatically adapts its layout to various screen sizes, orientations, and resolutions on desktop browsers and mobile devices.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/85083-635337788203299682_135x241_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/85083-635746783911079929_1047x1860_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/HTML-tutorials/Creating-an-Adaptive-Web-Site-for-Multiple-Screens/85083-2.html"
    },
    "WelcomeVideoId": 92075
  },
  {
    "ID": 90368,
    "DurationInSeconds": 14481,
    "Title": "CSS: Styling Forms",
    "Description": "This course covers CSS best practices and techniques for styling and structuring forms. Author Ray Villalobos explains how forms work, best practices for structuring HTML, new additions to forms in HTML5, and how to style individual elements. The course discusses how to use CSS to style traditional and custom elements and reviews browser discrepancies, custom elements, and custom fonts and how to style for different types of user feedback. Advanced CSS layouts and design patterns and issues specific to styling for handhelds are also covered. ",
    "ShortDescription": "CSS best practices and techniques for styling and structuring HTML and HTML5 forms.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/90368-635628933755693361_130x231_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/90368-635709985353942954_1440x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Web-Interactive-CSS-tutorials/CSS-Styling-Forms/90368-2.html"
    },
    "WelcomeVideoId": 97106
  },
  {
    "ID": 162449,
    "DurationInSeconds": 12027,
    "Title": "Data Visualization with D3.js",
    "Description": "Creating data-driven visualizations and infographics that run on multiple devices responsively is a tough challenge. The D3.js library has revolutionized visualization by making it easier to parse your data and add meaningful interactivity. All you need to bring your data to life is D3, plus a bit of HTML, CSS, and JavaScript, and some SVG graphics. In this course staff author Ray Villalobos explores how the D3 library works, and how you can use it to parse data from different sources and create interactive, visually exciting infographics and visualizations. He'll review the basics—controlling HTML with jQuery-esque selections and customizing attributes with D3's CSS-like language—before moving on to working with SVG graphics, the best choice for graphics in D3 visualizations. He'll also cover working with D3 methods like scaling, events, transitions, and animations; data manipulation (including connecting to external data sources); and creating different types of layouts, including a draggable force-driven layout.",
    "ShortDescription": "Bring your data to life with D3.js. Create interactive, visually exciting infographics and visualizations with HTML, CSS, JavaScript, and SVG graphics.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/162449-635430357764050013_132x234_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/162449-635472336058471848_1080x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/D3js-tutorials/Data-Visualization-D3js/162449-2.html"
    },
    "WelcomeVideoId": 185042
  },
  {
    "ID": 108135,
    "DurationInSeconds": 5337,
    "Title": "EaselJS First Look",
    "Description": "EaselJS is a free JavaScript library that makes creating interactive web content for HTML5 more straightforward and intuitive. This course transitions web designers, animators, and content creators who may be used to working with Adobe Flash and ActionScript to this new open web standard. Author Ray Villalobos first explains the capabilities of the EaselJS framework and the HTML5 Canvas element, and what they mean for web design. The rest of the course shows how to use EaselJS's helper classes and hierarchal display list to load images, draw, animate, and handle mouse input from visitors.",
    "ShortDescription": "Introduces the EaselJS framework and the HTML5 Canvas element, and shows how to create interactive web content with this open web standard.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/108135-635709949952942759_133x236_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/108135-635733936055626989_1047x1860_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/CreateJS-tutorials/EaselJS-First-Look/108135-2.html"
    },
    "WelcomeVideoId": 112940
  },
  {
    "ID": 103686,
    "DurationInSeconds": 6982,
    "Title": "Edge First Look Preview 6",
    "Description": "This course takes a first look at Edge, a new tool from Adobe for creating interactive animations, which utilizes the latest web standards including HTML5, JavaScript, and jQuery. This course covers how to create and build interactivity into motion content in an easy-to-use, timeline-based interface. Author Ray Villalobos also explains the possibilities Edge offers web designers and developers, including drawing and animating with Edge, working with the timeline, exploring symbols, and creating interactivity with timeline triggers and scripts.",
    "ShortDescription": "Take a first look at Edge, a new tool from Adobe for creating interactive motion graphics, which utilizes the latest web standards including HTML5, JavaScript, and jQuery.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/103686-635472412877473333_132x234_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/103686-635637048104645841_1046x1858_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Edge-tutorials/Edge-First-Look-Preview-6/103686-2.html"
    },
    "WelcomeVideoId": 107139
  },
  {
    "ID": 97617,
    "DurationInSeconds": 19344,
    "Title": "Fireworks CS6 Essential Training",
    "Description": "Join Ray Villalobos in this course, Fireworks CS6 Essential Training, as he shows how to create custom web graphics and web site mockups with Adobe Fireworks CS6. The initial chapters explain the basics: how to get around in the interface and create and organize documents. The course proceeds to cover all the essential drawing features in Fireworks, from drawing simple lines and shapes to applying fills, strokes, and opacity values to objects. The course also covers how to move, scale, and otherwise transform text and images as well as create symbols, use sprites, and integrate CSS and jQuery Mobile.",
    "ShortDescription": "Shows how to create custom web graphics and web site mockups with Fireworks CS6.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/97617-635405373311925526_131x232_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/97617-635749262608197536_1080x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Fireworks-tutorials/Fireworks-CS6-Essential-Training/97617-2.html"
    },
    "WelcomeVideoId": 104321
  },
  {
    "ID": 97616,
    "DurationInSeconds": 3658,
    "Title": "Fireworks CS6 New Features",
    "Description": "Join Ray Villalobos as he explores the new features and enhancements to Fireworks, the Adobe web graphic and prototyping application. The course covers color workflow improvements, such as quicker access to colors and new stroke and fill opacity controls, and user experience improvements, such as an expanded UI, an updated file naming convention, and sprite generation. The course also explores the addition of CSS and jQuery, which enhance the interactivity of documents created in Fireworks, and the addition of CSS properties and jQuery Mobile templates, which help integrate Fireworks into web design and development workflows.",
    "ShortDescription": "Explore the new features and enhancements to Fireworks, the Adobe web graphic and prototyping application.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/97616-635399071095804579_132x234_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/97616-635748884547950209_1080x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Fireworks-tutorials/Fireworks-CS6-New-Features/97616-2.html"
    },
    "WelcomeVideoId": 102798
  },
  {
    "ID": 69792,
    "DurationInSeconds": 12389,
    "Title": "iOS 4 Web Applications with HTML5 and CSS3",
    "Description": "iOS 4 Web Applications with HTML5 and CSS3 with Ray Villalobos teaches web developers how to leverage their existing CSS and HTML knowledge to create content that displays on iOS devices. The course covers creating animation to produce powerful interactive content, including a photo gallery and a video player. Cutting edge HTML5 and CSS3 techniques for formatting type, creating list driven menus, toggle buttons, and more are also included. The resulting web content will be tailored for viewing on the iPhone and the iPad, but will also work on websites viewed with browsers on other platforms as well. Exercise files are included with the course.",
    "ShortDescription": "Teaches Shows web developers how to leverage their existing CSS and HTML knowledge to create content that displays on iOS devices.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/69792-635400465092454159_150x265_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/69792-635444965403457868_1046x1858_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/HTML-5-tutorials/ios-4-web-applications-with-html5-and-css3/69792-2.html"
    },
    "WelcomeVideoId": 79343
  },
  {
    "ID": 114900,
    "DurationInSeconds": 4376,
    "Title": "JavaScript and AJAX",
    "Description": "The ability to read data and communicate information asynchronously is fundamental to modern web applications. In this course, author Ray Villalobos takes a look at integrating AJAX (Asynchronous JavaScript and XML) with JavaScript and jQuery—a combination that makes it easy to work with dynamic data and reduces the number of requests to the server. The course first explains what AJAX is, and shows how to load and reload pages with pure JavaScript, update the DOM, and read and parse data in the XML and JSON formats. Next, learn how to read and write information between the server and the client with AJAX methods in jQuery, and build a dynamic search application that updates search results as you type.",
    "ShortDescription": "Explore how to load dynamic content from JavaScript and jQuery using AJAX methods.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/114900-635409160791727412_130x231_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/114900-635649229559678570_1440x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Developer-tutorials/JavaScript-and-AJAX/114900-2.html"
    },
    "WelcomeVideoId": 120859
  },
  {
    "ID": 114901,
    "DurationInSeconds": 4325,
    "Title": "JavaScript and JSON",
    "Description": "JavaScript Object Notation (JSON) has replaced XML as the core way of sharing data, especially when it comes to JavaScript, since it's so much faster, sleeker, and easier to parse. In this course, dive into working with JSON tools, designing JSON objects, and using different ways to handling JSON data. Author Ray Villalobos also shows how to use AJAX and jQuery to parse your data and feeds, and shows JavaScript and JSON in action in a real-world practical application.",
    "ShortDescription": "Explore how the JavaScript Object Notation (JSON) format works and how you can use it to read and share data in your web projects.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/114901-635383115549312995_134x238_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/114901-635660370865750711_2016x3584_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/JavaScript-tutorials/JavaScript-JSON/114901-2.html"
    },
    "WelcomeVideoId": 125757
  },
  {
    "ID": 122462,
    "DurationInSeconds": 7423,
    "Title": "JavaScript: Enhancing the DOM",
    "Description": "The Document Object Model (DOM) is at the core of every HTML page. In order to develop dynamic HTML pages, a front-end developer needs to understand how JavaScript connects to and controls the DOM, allowing you to create, modify, delete, and edit existing page content. This course focuses on helping you understand the DOM elements, and shows the different ways JavaScript gives you access to them and makes it easier to work with the DOM. Author Ray Villalobos covers navigating the DOM, selecting elements, modifying HTML attributes, editing nodes, and much more.",
    "ShortDescription": "Learn to modify the DOM (Document Object Model), one of the core components of every HTML page, with JavaScript.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/122462-635382114048231779_137x243_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/122462-635660340074429332_2016x3584_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/HTML-tutorials/JavaScript-Enhancing-DOM/122462-2.html"
    },
    "WelcomeVideoId": 137612
  },
  {
    "ID": 140780,
    "DurationInSeconds": 7860,
    "Title": "JavaScript: Events",
    "Description": "Learn about the different types of JavaScript events available to use in your applications, including traditional events like mouse, form, and window events, plus events that allow you to manage the DOM and HTML5 events that deal with media. Author Ray Villalobos shows how to propagate and register events during the capturing and bubbling phases, cancel an event or default behavior, and respond to clicks, mouse-overs, right-clicks, following the mouse, and loading images. Plus, Ray demos an audio jukebox project and a drag-and-drop game that shows JavaScript desktop and touch events in action.",
    "ShortDescription": "Learn to use JavaScript events to respond to clicks, form input, and touch gestures in your web applications.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/140780-635150150372659321_123x218_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/140780-635772723652550747_1080x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/JavaScript-tutorials/JavaScript-Events/140780-2.html"
    },
    "WelcomeVideoId": 148710
  },
  {
    "ID": 148137,
    "DurationInSeconds": 5130,
    "Title": "JavaScript: Functions",
    "Description": "What are JavaScript functions? They're the \"subprograms\" that power your code. You truly master the use of JavaScript once you learn how to work with functions. In this course, author Ray Villalobos explains how functions work, how they're declared, and how they're invoked, and then issues a challenge exercise that allows you to test your knowledge. In the third and final chapter, he'll show you how to set up anonymous closures and create JavaScript modules that make your code easier to reuse.",
    "ShortDescription": "Learn the different ways of declaring and invoking JavaScript functions, the \"subprograms\" that power your code.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/148137-635227910315756390_163x290_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/148137-635539959374603285_1440x2560_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/JavaScript-tutorials/JavaScript-Functions/148137-2.html"
    },
    "WelcomeVideoId": 158386
  },
  {
    "ID": 94250,
    "DurationInSeconds": 6088,
    "Title": "Managing a Hosted Web Site",
    "Description": "Managing a Hosted Web Site shows how to set up a web site on a host's server and perform common server tasks. Working in two web hosting utilities, cPanel and Plesk, as well as in a custom control panel, author Ray Villalobos explores purchasing a domain, setting up FTP accounts, and configuring web mail. The course also explains setting up password protection, creating a MySQL database, and working with subdomains. ",
    "ShortDescription": "Shows how to set up a site with a web host and perform common server tasks.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/94250-635459884140782358_138x244_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/94250-635594447357179980_1152x2048_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/cPanel-tutorials/Managing-Hosted-Web-Site/94250-2.html"
    },
    "WelcomeVideoId": 99904
  },
  {
    "ID": 137904,
    "DurationInSeconds": 7344,
    "Title": "Online Presentations with reveal.js",
    "Description": "For web designers and developers, tools like PowerPoint and Keynote lack the power that's available to web browsers. Reveal.js allows you to create presentations that use the full power of the web, providing syntax highlighting for code, mobile pinch and swipe support, CSS theming, and the ability to integrate with other libraries and frameworks like jQuery and EaselJS. Explore reveal.js with Ray Villalobos, as he shows how to build slideshows with a text editor and a browser, and incorporate audio and video, animation, and CSS styling.",
    "ShortDescription": "Build slideshows that harness the full power of the web with reveal.js.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/137904-635505556385203553_134x238_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/137904-635735961746038712_1200x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/CSS-tutorials/Online-Presentations-revealjs/137904-2.html"
    },
    "WelcomeVideoId": 147625
  },
  {
    "ID": 140777,
    "DurationInSeconds": 12139,
    "Title": "Responsive CSS with Sass and Compass",
    "Description": "Using a framework helps simplify your workflow and makes writing CSS fun again. Learn how Compass (powered by Sass) can help you build responsive layouts that are easier, faster, and more compatible than using CSS alone. In this course, Ray Villalobos shows how to automate your workflow with Grunt.js, scaffold your HTML, modularize your Sass with partials, and get started styling with variables and mixins. Plus, learn how to create a mobile-first grid with Susy—without adding nonsemantic HTML markup.",
    "ShortDescription": "Learn how Compass (powered by Sass) can help you build a responsive layout workflow that is easier, faster, and more compatible than CSS alone.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/140777-635763590076435432_159x282_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/140777-635579866350756880_1080x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/CSS-tutorials/Responsive-CSS-Sass-Compass/140777-2.html"
    },
    "WelcomeVideoId": 153456
  },
  {
    "ID": 154414,
    "DurationInSeconds": 4720,
    "Title": "Up and Running with AngularJS",
    "Description": "Get a fresh look at AngularJS, a \"superheroic\" framework for building single-page web applications fast. Ray Villalobos shows you how to understand the practical uses of AngularJS with a directory search project—a traditional type of web app you can add to your existing sites. He defines the MVC architecture underlying AngularJS: the model (your data), views (how data is flowed into your template), and controllers (the JavaScript that links the two together). You then learn how to divide your project into modules; work with services like $http, $routeProvider, and animation; and set up deep linking and navigation. Start now, and learn the simple way to build your own complex web application.",
    "ShortDescription": "Get a fresh look at AngularJS, a framework for building single-page web applications fast.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/154414-635384894078922070_207x368_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/154414-635649045809406384_1440x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/AngularJS-tutorials/Up-Running-AngularJS/154414-2.html"
    },
    "WelcomeVideoId": 167514
  },
  {
    "ID": 154415,
    "DurationInSeconds": 6498,
    "Title": "Up and Running with CoffeeScript",
    "Description": "Learning CoffeeScript allows front-end developers to write JavaScript more beautifully and efficiently. It gives your code an extra zing. This course teaches the best features from the CoffeeScript language, like splats and ranges, plus how to write common JavaScript commands more efficiently using CoffeeScript. Author Ray Villalobos also shows how to work with Gulp.js, a streaming build system for not only CoffeeScript, but also Sass, LESS, JavaScript, and CSS.",
    "ShortDescription": "Learn about CoffeeScript, a language that compiles into JavaScript and allows you to write fast, efficient, and beautiful JavaScript code.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/154415-635750995995763290_253x449_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/154415-635588852672887369_1440x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Developer-Web-Design-tutorials/Up-Running-CoffeeScript/154415-2.html"
    },
    "WelcomeVideoId": 168010
  },
  {
    "ID": 409275,
    "DurationInSeconds": 4911,
    "Title": "Up and Running with Git and GitHub",
    "Description": "Version control is an essential skill for developers to master, and Git is by far the most popular version control system on the web. In this fast-paced course, author Ray Villalobos shows you how to install Git and use the fundamental commands you need to work with Git projects: moving files, managing logs, and working with branches. Plus, you'll learn how to work with the popular GitHub website to explore existing projects, clone them to your local hard drive, and use them as templates for your new projects. Get started now.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/409275-635721397427583922_152x270_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/409275-635724498203640784_1440x2160_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Git-tutorials/Up-Running-Git-GitHub/409275-2.html"
    },
    "WelcomeVideoId": 416541
  },
  {
    "ID": 409274,
    "DurationInSeconds": 2114,
    "Title": "Up and Running with NPM, the Node Package Manager",
    "Description": "Imagine being able to share and reuse common JavaScript libraries like Grunt, Gulp, and Underscore, in addition to custom code. With the Node Package Manager, reusing code is a snap, making it an indispensible part of every developer's toolbox. In this course, Ray Villalobos shows experienced developers how to install NPM on Macs and PCs, and use NPM commands and packages to track project dependencies and control installations.",
    "ShortDescription": "Learn how to install and work with NPM, the Node Package Manager that allows JavaScript developers to share and reuse code.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/409274-635715109130106049_214x379_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/409274-635718294766410378_1080x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Developer-Web-Development-tutorials/Up-Running-NPM-Node-Package-Manager/409274-2.html"
    },
    "WelcomeVideoId": 415859
  },
  {
    "ID": 120466,
    "DurationInSeconds": 10265,
    "Title": "Validating and Processing Forms with JavaScript and PHP",
    "Description": "Validating web forms is a critical skill for any web developer, ensuring that the data that's submitted is complete, accurate, and nonmalicious before it's sent off to the server. Join author Ray Villalobos in this course as he shows how to validate input from site visitors with HTML5, JavaScript, and jQuery and then process the data with PHP. Plus, learn how to email form data and save it in a MySQL database so that it's ready for other applications.",
    "ShortDescription": "Learn how to ensure the data submitted to your web forms is complete, accurate, and nonmalicious with HTML5, JavaScript, jQuery, and PHP form processing and validation.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/120466-635718044006401212_141x250_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/120466-635627706096574111_1440x2560_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Developer-Databases-tutorials/Validating-Processing-Forms-JavaScript-PHP/120466-2.html"
    },
    "WelcomeVideoId": 133550
  },
  {
    "ID": 93388,
    "DurationInSeconds": 7803,
    "Title": "View Source",
    "Description": "The View Source weekly series offers 10-minute projects on intermediate and advanced web design topics, covering technologies such as HTML, PHP, jQuery, and CSS, as well as content management solutions like WordPress and integration with Twitter, YouTube, and more. Each movie in the course is self-contained and shows how to accomplish an interesting effect and/or technique. Example projects include creating datepickers and custom photo galleries, and mapping and geotagging with Google Maps. ",
    "ShortDescription": "Ten-minute projects on intermediate and advanced web design topics, covering technologies such as HTML, PHP, jQuery, and CSS, as well as content management solutions like WordPress and integration with Twitter, YouTube, and more.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/93388-635439659316669881_137x242_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/93388-635439227074069976_1046x1858_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Web-Interactive-Projects-tutorials/View-Source/93388-2.html"
    },
    "WelcomeVideoId": 106323
  },
  {
    "ID": 154416,
    "DurationInSeconds": 9652,
    "Title": "Web Project Workflows with Gulp.js, Git, and Browserify",
    "Description": "Modern front-end development means more than just writing HTML, CSS, and JavaScript. Developing an efficient workflow will help you write better code and test and deploy your web applications easily and efficiently. Staff author Ray Villalobos is here to show you how to generate a workflow that makes it easier to build websites with processed languages like Sass, Compass, and CoffeeScript. He'll show how to automate development and production versions of your sites, track and share project files with Git and GitHub, and add libraries like jQuery and Mustache.js with Browserify. All of these techniques should easily translate to building your own web projects.",
    "ShortDescription": "Learn how to generate a workflow that makes it easier to build your own websites, track and share project files, and leverage JavaScript and jQuery code libraries.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/154416-635391992384001097_133x235_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/154416-635756223839330941_1089x1936_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Web-Web-Design-tutorials/Web-Project-Workflows-Gulpjs-Git-Browserify/154416-2.html"
    },
    "WelcomeVideoId": 179252
  },
  {
    "ID": 368921,
    "DurationInSeconds": 4632,
    "Title": "Web Workflows with Grunt.js",
    "Description": "Developing a workflow will help you program, test, and deploy your web applications more easily and efficiently. Tools like Grunt.js make generating workflows as easy as writing a setup file. Here Ray Villalobos covers the key steps in creating a Grunt-based web workflow, from creating tasks to process Sass and combine scripts to automating the entire workflow. He also shows how to use Bower.io to quickly load frameworks such as Bootstrap, jQuery, and Mustache.js.",
    "ShortDescription": "Program, test, and deploy your web applications more easily and efficiently with a Grunt.js development workflow.",
    "Thumbnails": [
      {
        "FullURL": "https://cdn.lynda.com/courses/368921-635724216433889982_133x236_thumb.jpg"
      },
      {
        "FullURL": "https://cdn.lynda.com/courses/368921-635761060525266192_1128x1920_thumb.jpg"
      }
    ],
    "URLs": {
      "www.lynda.com": "/Grunt.js-tutorials/Web-Workflows-Grunt.js/368921-2.html"
    },
    "WelcomeVideoId": 418525
  }
]
